Revit 2027 API
BuiltInFailures.DesignOptionFailures.NoSelectedInOption Property
 None of the selected elements can be added to this Option Set. The following warnings provide additional information.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoSelectedInOption { get; }
Public Shared ReadOnly Property NoSelectedInOption As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoSelectedInOption {
	FailureDefinitionId^ get ();
}
static member NoSelectedInOption : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DesignOptionFailures Class
Autodesk.Revit.DB Namespace